message_1 = "Дружище, попади правильно по клавиатуре :-("
message_2 = "Здравствуйте, уважаемый пользователь! Сейчас мы будем искать вам пару. Будем выводить только тех " \
            "пользователей, у которых аккаунт не закрыт, в наличие минимум 3 фотографии категории 'wall', и рейтинг " \
            "ВКонтакте = maximum. Время моего ответа может составлять до 3 секунд. " \
            "\n\nОбратите внимание, при длительном использовании программы, библиотека vk_api прекратит работу с " \
            "исключением: <vk_api.exceptions.ApiError: [9] Flood control: too much messages sent to user>." \
            "\nДавайте начнем с пола. " \
            "Введите 'м' или 'ж' и нажмите Enter."

message_3 = "Пол выбран! Выберите возрастную категорию и нажмите enter:\n" \
            "1 - <18-25>\n" \
            "2 - <26-32>\n" \
            "3 - <33-42>\n" \
            "4 - <43-55>\n" \
            "5 - <55 + >\n"

message_4 = "Возраст выбран! Давайте определим семейный статус кандидата. Выберите категорию и нажмите enter:\n" \
            "а - <не женат (не замужем)>\n" \
            "б - <в активном поиске>\n" \
            "в - <все сложно>"

message_5 = "Семейный статус выбран! Осталось ввести название города, из которого вы хотите найти свою любовь, " \
            "и нажать Enter."

message_6 = 'Все параметры заполнены! Вам представлены несколько кандидатур. Они соответствуют заданным параметрам. ' \
            'Можно перейти по ссылке, посмотреть, нравится человек или нет.' \
            '\n ● Если кто-то нравится, то в формате <нравится_2> введите номер претендента (добавлять можно ' \
            'только по одному) и нажмите Enter. Мы добавим его в список понравившихся.' \
            '\n ● Если же хотите пополнить ваш черный список этими людьми, то введите номера ссылок на профили этих ' \
            'людей в формате <чс_1> (добавлять можно только по одному) и нажмите Enter.' \
            '\n ● Если хотите пропустить все и перейти к следующим претендентам, то наберите 0 и нажмите Enter.' \
            '\n ● Если хотите вернуться в начало поиска, наберите <привет> и нажмите Enter.'

message_7 = "Супер! Все что нужно, мы переместили в чс :-) Можете проверить это в настройках своего аккаунта Вконтаке." \
            "\n ● Будем повторно искать кандидатов с такими параметрами? Наберите '0' и нажмите Enter." \
            "\n ● Если хотите кого-либо удалить из черного списка, введите номер его ссылки в формате <убрать_2> " \
            "(убирать можно только по одному)"

message_8 = "Супер! Все что нужно, удалено из чс :-) Можете проверить это в настройках своего аккаунта Вконтаке." \
            "\n ● Будем повторно искать кандидатов с такими параметрами? Наберите '0' и нажмите Enter." \
            "\n ● Если хотите вернуться в начало поиска, наберите <привет> и нажмите Enter."

message_9 = "Супер! Все, что нужно, внесено в список понравившихся :-)" \
            "\n ● Будем повторно искать кандидатов с такими параметрами? Наберите '0' и нажмите Enter." \
            "\n ● Если хотите просмотреть список понравившихся кандидатов, наберите <хочу> и нажмите Enter."

message_10 = "Вот все понравившиеся:-)" \
             "\n ● Удалить кого-нибудь из понравившихся? Если да, то наберите номер ссылки в формате " \
             "<разонравился_2> (удалять можно только по одному) и нажмите Enter." \
             "\n ● Если хотите заново начать поиск, наберите <привет> и нажмите Enter."

message_11 = "Разонравившийся удален из списка понравившихся." \
             "\n ● Если хотите заново начать поиск, наберите <привет> и нажмите Enter." \
             "\n ● Если хотите просмотреть список понравившихся кандидатов, наберите <хочу> и нажмите Enter." \
             "\n ● Если хотите еще удалить кого-нибудь из понравившихся, наберите номер ссылки в формате " \
             "<разонравился_2> (удалять можно только по одному) и нажмите Enter."

message_12 = "Все, по этим параметра больше никого нет. Вот все, кто есть." \
             "\n ● Если кто-то нравится, то в формате <нравится_2> введите номер претендента (добавлять можно " \
             "только по одному) и нажмите Enter. Мы добавим его в список понравившихся." \
             "\n ● Если хотите заново начать поиск, наберите <привет> и нажмите Enter." \
             "\n ● Если хотите просмотреть список понравившихся кандидатов, наберите <хочу> и нажмите Enter."

message_13 = "Вам уже показывались люди по таким параметрам! Если хотите еще увидеть подобных, то наберите <т> и " \
             "нажмите Enter."

message_14 = "Подождите 10 секунд :-), не уходите:-))"

message_15 = "Данные занесены базу данных. Программа завершена. Теперь перейдите в вашем IDE в папку <output_data> " \
             "и запустите файл <json_dump>, после чего у вас появится в той же директории файл " \
             "<program_result_output.json>  с результатми работы данной программы. " \
             "\nА так же в корневой папке вы найдете файл <logs.log> в котором представлен ход работы некоторых " \
             "функций,  это интересно)." \
             "\nСпасибо, что выбрали нас :-)."
